# Task1. Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

text = 'абв абввв  абвмпабв абвабвабвб веуваб ааббвв'
text = text.replace('абв', '')
print(text)