# Задайте список из нескольких чисел. Напишите программу, 
# которая найдёт сумму элементов списка, стоящих на нечётной позиции.

# Пример:

# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
import random
lst = []
for i in range(random.randint(5, 15)):
    lst.append(random.randint(1, 20))
print(f'Список из нескольких чисел - {lst}')

sum = 0
for i in range(len(lst)):
    if (i % 2 == 1):
        sum +=  lst[i]
print(f'Cумма элементов списка, стоящих на нечётной позиции, равна - {sum}')
    
