# Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму
# Пример:
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

n = int(input('Введите число: '))
sum = 0
print(f'Для n = {n}: ', end = ' ')
for i in range(1, n+1):
    sum += ((1+1/n)**n)
    print(f' {i}: {round(sum, 2)},', end = ' ')

